2013/brp 2013-02-07/test/branches/v0.2.5/PUC501 OPvB - Opvragen details persoon en relaties/ART/request_template.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header>${DataSource Values#Header_EEE0}</soapenv:Header>
   <soapenv:Body>
      <ns:bevragen_VraagDetailsPersoon xmlns:ns="http://www.bprbzk.nl/BRP/0001"
                                       ns:cIDVerzendend="${DataSource Values#|bevragen_DP|}">
         <ns:stuurgegevens ns:cIDVerzendend="${DataSource Values#|stuurgegevens|}">
            <ns:organisatie>${DataSource Values#organisatie_sbB0}</ns:organisatie>
            <ns:applicatie>${DataSource Values#applicatie_sbB0}</ns:applicatie>
            <ns:referentienummer>${DataSource Values#referentienummer_sbB0}</ns:referentienummer>
         </ns:stuurgegevens>
         <ns:vraag ns:cIDVerzendend="${DataSource Values#|vraag|}">
            <ns:opties ns:cIDVerzendend="${DataSource Values#|opties|}">
               <ns:historieMaterieel>${DataSource Values#historieMaterieel_ovb0}</ns:historieMaterieel>
               <ns:historieFormeel>${DataSource Values#historieFormeel_ovb0}</ns:historieFormeel>
               <ns:aanschouwer>${DataSource Values#aanschouwer_ovb0}</ns:aanschouwer>
            </ns:opties>
            <ns:zoekcriteria ns:cIDVerzendend="${DataSource Values#|zoekcriteria|}">
               <ns:peilmomentMaterieel>${DataSource Values#peilmomentMaterieel_zvb0}</ns:peilmomentMaterieel>
               <ns:peilmomentFormeel>${DataSource Values#peilmomentFormeel_zvb0}</ns:peilmomentFormeel>
               <ns:burgerservicenummer>${DataSource Values#burgerservicenummer_zvb0}</ns:burgerservicenummer>
            </ns:zoekcriteria>
         </ns:vraag>
      </ns:bevragen_VraagDetailsPersoon>
   </soapenv:Body>
</soapenv:Envelope>
