2013/brp 2013-02-07/ARTengine/trunk/temp/input_for_request_template.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.bprbzk.nl/BRP/0001">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:bevragen_VraagPersonenOpAdresInclusiefBetrokkenheden ns:cIDVerzendend="?">
         <ns:stuurgegevens ns:cIDVerzendend="?">
            <ns:organisatie ns:noValue="?">?</ns:organisatie>
            <ns:applicatie ns:noValue="?">?</ns:applicatie>
            <ns:referentienummer ns:noValue="?">?</ns:referentienummer>
         </ns:stuurgegevens>
         <ns:vraag ns:cIDVerzendend="?">
            <!--Optional:-->
            <ns:opties ns:cIDVerzendend="?">
               <!--Optional:-->
               <ns:historieMaterieel ns:noValue="?">?</ns:historieMaterieel>
               <!--Optional:-->
               <ns:historieFormeel ns:noValue="?">?</ns:historieFormeel>
               <!--Optional:-->
               <ns:aanschouwer ns:noValue="?">?</ns:aanschouwer>
            </ns:opties>
            <ns:zoekcriteria ns:cIDVerzendend="?">
               <!--Optional:-->
               <ns:peilmomentMaterieel ns:noValue="?">?</ns:peilmomentMaterieel>
               <!--Optional:-->
               <ns:peilmomentFormeel ns:noValue="?">?</ns:peilmomentFormeel>
               <!--Optional:-->
               <ns:burgerservicenummer ns:noValue="?">?</ns:burgerservicenummer>
               <!--Optional:-->
               <ns:gemeenteCode ns:noValue="?">?</ns:gemeenteCode>
               <!--Optional:-->
               <ns:naamOpenbareRuimte ns:noValue="?">?</ns:naamOpenbareRuimte>
               <!--Optional:-->
               <ns:huisnummer ns:noValue="?">?</ns:huisnummer>
               <!--Optional:-->
               <ns:huisletter ns:noValue="?">?</ns:huisletter>
               <!--Optional:-->
               <ns:huisnummertoevoeging ns:noValue="?">?</ns:huisnummertoevoeging>
               <!--Optional:-->
               <ns:postcode ns:noValue="?">?</ns:postcode>
            </ns:zoekcriteria>
         </ns:vraag>
      </ns:bevragen_VraagPersonenOpAdresInclusiefBetrokkenheden>
   </soapenv:Body>
</soapenv:Envelope>