2013/brp 2013-02-07/test/branches/v0.2.5/KUC042/ART/request_template.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:huwelijkPartnerschap_RegistratieHuwelijk_Bijhouding xmlns:ns="http://www.bprbzk.nl/BRP/0001"
                                                              ns:cIDVerzendend="id.huwelijkPartnerschap_RegistratieHuw">
         <ns:stuurgegevens ns:cIDVerzendend="id.stuurgegevens">
            <ns:organisatie>${DataSource Values#organisatie_shB}</ns:organisatie>
            <ns:applicatie>${DataSource Values#applicatie_shB}</ns:applicatie>
            <ns:referentienummer>${DataSource Values#referentienummer_shB}</ns:referentienummer>
            <ns:indicatiePrevalidatie>${DataSource Values#indicatiePrevalidatie_shB}</ns:indicatiePrevalidatie>
         </ns:stuurgegevens>
         <ns:overruleMeldingen>
            <ns:overrule ns:cIDVerzendend="${DataSource Values#|overrule_1|}">
               <ns:regelCode>${DataSource Values#regelCode_ooh_1}</ns:regelCode>
               <ns:melding>${DataSource Values#melding_ooh_1}</ns:melding>
               <ns:attribuutNaam>${DataSource Values#attribuutNaam_ooh_1}</ns:attribuutNaam>
            </ns:overrule>
			<ns:overrule ns:cIDVerzendend="${DataSource Values#|overrule_2|}">
               <ns:regelCode>${DataSource Values#regelCode_ooh_2}</ns:regelCode>
               <ns:melding>${DataSource Values#melding_ooh_2}</ns:melding>
               <ns:attribuutNaam>${DataSource Values#attribuutNaam_ooh_2}</ns:attribuutNaam>
            </ns:overrule>
         </ns:overruleMeldingen>
         <ns:acties>
            <ns:registratieHuwelijk ns:cIDVerzendend="id.registratieHuwelijk">
               <ns:datumAanvangGeldigheid>${DataSource Values#datumAanvangGeldigheid_rah}</ns:datumAanvangGeldigheid>
               <ns:tijdstipOntlening>${DataSource Values#tijdstipOntlening_rah}</ns:tijdstipOntlening>
               <ns:toelichtingOntlening>${DataSource Values#toelichtingOntlening_rah}</ns:toelichtingOntlening>
               <ns:bronnen>
                  <ns:bron ns:cIDVerzendend="id.bronHuw1">
                     <ns:document ns:cIDVerzendend="id.documentHuw1">
                        <ns:soortNaam>${DataSource Values#soortNaam_dbb}</ns:soortNaam>
                        <ns:identificatie>${DataSource Values#identificatie_dbb}</ns:identificatie>
                        <ns:aktenummer>${DataSource Values#aktenummer_dbb}</ns:aktenummer>
                        <ns:omschrijving>${DataSource Values#omschrijving_dbb}</ns:omschrijving>
                        <ns:partijCode>${DataSource Values#partijCode_dbb}</ns:partijCode>
                     </ns:document>
                  </ns:bron>
               </ns:bronnen>
               <ns:huwelijk ns:cIDVerzendend="id.huwelijk1">
                  <ns:datumAanvang>${DataSource Values#datumAanvang_hra}</ns:datumAanvang>
                  <ns:gemeenteAanvangCode>${DataSource Values#gemeenteAanvangCode_hra}</ns:gemeenteAanvangCode>
                  <ns:woonplaatsAanvangCode>${DataSource Values#woonplaatsAanvangCode_hra}</ns:woonplaatsAanvangCode>
                  <ns:betrokkenheden>
                     <ns:partner ns:cIDVerzendend="id.partner1">
                        <ns:persoon ns:cIDVerzendend="id.persoon1">
                           <ns:identificatienummers ns:cIDVerzendend="id.identificatienummers1">
                              <ns:burgerservicenummer>${DataSource Values#burgerservicenummer_ipp_1}</ns:burgerservicenummer>
                           </ns:identificatienummers>
                           <ns:geslachtsaanduiding ns:cIDVerzendend="id.geslachtsaanduiding1">
                              <ns:code>${DataSource Values#code_gpp_1}</ns:code>
                           </ns:geslachtsaanduiding>
                           <ns:samengesteldeNaam ns:cIDVerzendend="id.samengesteldeNaam1">
                              <ns:predikaatCode>${DataSource Values#predikaatCode_spp_1}</ns:predikaatCode>
                              <ns:voornamen>${DataSource Values#voornamen_spp_1}</ns:voornamen>
                              <ns:voorvoegsel>${DataSource Values#voorvoegsel_spp_1}</ns:voorvoegsel>
                              <ns:scheidingsteken>${DataSource Values#scheidingsteken_spp_1}</ns:scheidingsteken>
                              <ns:adellijkeTitelCode>${DataSource Values#adellijkeTitelCode_spp_1}</ns:adellijkeTitelCode>
                              <ns:geslachtsnaam>${DataSource Values#geslachtsnaam_spp_1}</ns:geslachtsnaam>
                           </ns:samengesteldeNaam>
                           <ns:geboorte ns:cIDVerzendend="id.geboorte1">
                              <ns:datum>${DataSource Values#datum_gpp_1}</ns:datum>
                              <ns:gemeenteCode>${DataSource Values#gemeenteCode_gpp_1}</ns:gemeenteCode>
                              <ns:woonplaatsCode>${DataSource Values#woonplaatsCode_gpp_1}</ns:woonplaatsCode>
                              <ns:buitenlandseplaats>${DataSource Values#buitenlandseplaats_gpp_1}</ns:buitenlandseplaats>
                              <ns:buitenlandseRegio>${DataSource Values#buitenlandseRegio_gpp_1}</ns:buitenlandseRegio>
                              <ns:landCode>${DataSource Values#landCode_gpp_1}</ns:landCode>
                              <ns:omschrijvinglocatie>${DataSource Values#omschrijvinglocatie_gpp_1}</ns:omschrijvinglocatie>
                           </ns:geboorte>
                           <ns:afgeleidAdministratief ns:cIDVerzendend="id.afgeleidAdministratief1">
                              <ns:tijdstipLaatsteWijziging>${DataSource Values#tijdstipLaatsteWijziging_app_1}</ns:tijdstipLaatsteWijziging>
                           </ns:afgeleidAdministratief>
                        </ns:persoon>
                     </ns:partner>
                     <ns:partner ns:cIDVerzendend="id.partner2">
                        <ns:persoon ns:cIDVerzendend="id.persoon2">
                           <ns:identificatienummers ns:cIDVerzendend="id.identificatienummers2">
                              <ns:burgerservicenummer>${DataSource Values#burgerservicenummer_ipp_2}</ns:burgerservicenummer>
                           </ns:identificatienummers>
                           <ns:geslachtsaanduiding ns:cIDVerzendend="id.geslachtsaanduiding2">
                              <ns:code>${DataSource Values#code_gpp_2}</ns:code>
                           </ns:geslachtsaanduiding>
                           <ns:samengesteldeNaam ns:cIDVerzendend="id.samengesteldeNaam2">
                              <ns:predikaatCode>${DataSource Values#predikaatCode_spp_2}</ns:predikaatCode>
                              <ns:voornamen>${DataSource Values#voornamen_spp_2}</ns:voornamen>
                              <ns:voorvoegsel>${DataSource Values#voorvoegsel_spp_2}</ns:voorvoegsel>
                              <ns:scheidingsteken>${DataSource Values#scheidingsteken_spp_2}</ns:scheidingsteken>
                              <ns:adellijkeTitelCode>${DataSource Values#adellijkeTitelCode_spp_2}</ns:adellijkeTitelCode>
                              <ns:geslachtsnaam>${DataSource Values#geslachtsnaam_spp_2}</ns:geslachtsnaam>
                           </ns:samengesteldeNaam>
                           <ns:geboorte ns:cIDVerzendend="id.geboorte2">
                              <ns:datum>${DataSource Values#datum_gpp_2}</ns:datum>
                              <ns:gemeenteCode>${DataSource Values#gemeenteCode_gpp_2}</ns:gemeenteCode>
                              <ns:woonplaatsCode>${DataSource Values#woonplaatsCode_gpp_2}</ns:woonplaatsCode>
                              <ns:buitenlandseplaats>${DataSource Values#buitenlandseplaats_gpp_2}</ns:buitenlandseplaats>
                              <ns:buitenlandseRegio>${DataSource Values#buitenlandseRegio_gpp_2}</ns:buitenlandseRegio>
                              <ns:landCode>${DataSource Values#landCode_gpp_2}</ns:landCode>
                              <ns:omschrijvinglocatie>${DataSource Values#omschrijvinglocatie_gpp_2}</ns:omschrijvinglocatie>
                           </ns:geboorte>
                           <ns:afgeleidAdministratief ns:cIDVerzendend="id.afgeleidAdministratief2">
                              <ns:tijdstipLaatsteWijziging>${DataSource Values#tijdstipLaatsteWijziging_app_2}</ns:tijdstipLaatsteWijziging>
                           </ns:afgeleidAdministratief>
                        </ns:persoon>
                     </ns:partner>
                  </ns:betrokkenheden>
               </ns:huwelijk>
            </ns:registratieHuwelijk>
            <ns:wijzigingGeslachtsnaamcomponent ns:cIDVerzendend="id.wijzigingGeslachtsnaamcomponent1">
               <ns:datumAanvangGeldigheid>${DataSource Values#datumAanvangGeldigheid_wah_1}</ns:datumAanvangGeldigheid>
               <ns:tijdstipOntlening>${DataSource Values#tijdstipOntlening_wah_1}</ns:tijdstipOntlening>
               <ns:toelichtingOntlening>${DataSource Values#toelichtingOntlening_wah_1}</ns:toelichtingOntlening>
               <ns:bronnen>
                  <ns:bron ns:cIDVerzendend="id.bronWijz1">
                     <ns:document ns:cIDVerzendend="id.documentWijz1">
                        <ns:soortNaam>${DataSource Values#soortNaam_dbb_1}</ns:soortNaam>
                        <ns:identificatie>${DataSource Values#identificatie_dbb_1}</ns:identificatie>
                        <ns:aktenummer>${DataSource Values#aktenummer_dbb_1}</ns:aktenummer>
                        <ns:omschrijving>${DataSource Values#omschrijving_dbb_1}</ns:omschrijving>
                        <ns:partijCode>${DataSource Values#partijCode_dbb_1}</ns:partijCode>
                     </ns:document>
                  </ns:bron>
               </ns:bronnen>
               <ns:persoon ns:cIDVerzendend="id.persoonWijz1">
                  <ns:identificatienummers ns:cIDVerzendend="id.identificatienummersWijz1">
                     <ns:burgerservicenummer>${DataSource Values#burgerservicenummer_ipw_1}</ns:burgerservicenummer>
                  </ns:identificatienummers>
                  <ns:afgeleidAdministratief ns:cIDVerzendend="id.afgeleidAdministratiefWijz1">
                     <ns:tijdstipLaatsteWijziging>${DataSource Values#tijdstipLaatsteWijziging_apw_1}</ns:tijdstipLaatsteWijziging>
                  </ns:afgeleidAdministratief>
                  <ns:geslachtsnaamcomponenten>
                     <ns:geslachtsnaamcomponent ns:cIDVerzendend="id.geslachtsnaamcomponentWijz1">
                        <ns:volgnummer>${DataSource Values#volgnummer_ggp_1}</ns:volgnummer>
                        <ns:voorvoegsel>${DataSource Values#voorvoegsel_ggp_1}</ns:voorvoegsel>
                        <ns:scheidingsteken>${DataSource Values#scheidingsteken_ggp_1}</ns:scheidingsteken>
                        <ns:naam>${DataSource Values#naam_ggp_1}</ns:naam>
                     </ns:geslachtsnaamcomponent>
                  </ns:geslachtsnaamcomponenten>
               </ns:persoon>
            </ns:wijzigingGeslachtsnaamcomponent>
            <ns:wijzigingNaamgebruik ns:cIDVerzendend="id.wijzigingNaamgebruikWijz2">
               <ns:datumAanvangGeldigheid>${DataSource Values#datumAanvangGeldigheid_wah_2}</ns:datumAanvangGeldigheid>
               <ns:tijdstipOntlening>${DataSource Values#tijdstipOntlening_wah_2}</ns:tijdstipOntlening>
               <ns:toelichtingOntlening>${DataSource Values#toelichtingOntlening_wah_2}</ns:toelichtingOntlening>
               <ns:bronnen>
                  <ns:bron ns:cIDVerzendend="id.bronWijz2">
                     <ns:document ns:cIDVerzendend="id.documentWijz2">
                        <ns:soortNaam>${DataSource Values#soortNaam_dbb_2}</ns:soortNaam>
                        <ns:identificatie>${DataSource Values#identificatie_dbb_2}</ns:identificatie>
                        <ns:aktenummer>${DataSource Values#aktenummer_dbb_2}</ns:aktenummer>
                        <ns:omschrijving>${DataSource Values#omschrijving_dbb_2}</ns:omschrijving>
                        <ns:partijCode>${DataSource Values#partijCode_dbb_2}</ns:partijCode>
                     </ns:document>
                  </ns:bron>
               </ns:bronnen>
               <ns:persoon ns:cIDVerzendend="id.persoonWijz2">
                  <ns:identificatienummers ns:cIDVerzendend="id.identificatienummersWijz2">
                     <ns:burgerservicenummer>${DataSource Values#burgerservicenummer_ipw_2}</ns:burgerservicenummer>
                  </ns:identificatienummers>
                  <ns:aanschrijving ns:cIDVerzendend="id.aanschrijvingWijz2">
                     <ns:wijzeVanGebruikGeslachtsnaamEchtgenootGeregistreerdPartnerCode>${DataSource Values#wijzeVanGebruikGeslachtsnaamEchtgenootGeregistreerdPartnerCode_apw_2}</ns:wijzeVanGebruikGeslachtsnaamEchtgenootGeregistreerdPartnerCode>
                     <ns:indicatieAlgoritmischAfgeleid>${DataSource Values#indicatieAlgoritmischAfgeleid_apw_2}</ns:indicatieAlgoritmischAfgeleid>
                     <ns:voorvoegsel>${DataSource Values#voorvoegsel_apw_2}</ns:voorvoegsel>
                     <ns:scheidingsteken>${DataSource Values#scheidingsteken_apw_2}</ns:scheidingsteken>
                     <ns:geslachtsnaam>${DataSource Values#geslachtsnaam_apw_2}</ns:geslachtsnaam>
                  </ns:aanschrijving>
                  <ns:afgeleidAdministratief ns:cIDVerzendend="id.afgeleidAdministratiefWijz2">
                     <ns:tijdstipLaatsteWijziging>${DataSource Values#tijdstipLaatsteWijziging_apw_2}</ns:tijdstipLaatsteWijziging>
                  </ns:afgeleidAdministratief>
               </ns:persoon>
            </ns:wijzigingNaamgebruik>
         </ns:acties>
      </ns:huwelijkPartnerschap_RegistratieHuwelijk_Bijhouding>
   </soapenv:Body>
</soapenv:Envelope>
