2013/brp 2013-02-07/test/branches/v0.2.5/PUC501 OPvB - Bepalen personen op adres met relaties/ART/request_template.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header>${DataSource Values#Header_EEE0}</soapenv:Header>
   <soapenv:Body>
      <ns:bevragen_VraagPersonenOpAdresInclusiefBetrokkenheden xmlns:ns="http://www.bprbzk.nl/BRP/0001"
                                                               ns:cIDVerzendend="id.bevragen_VraagPersonenOpAdresInc0">
         <ns:stuurgegevens ns:cIDVerzendend="id.stuurgegevens0">
            <ns:organisatie>${DataSource Values#organisatie_sbB0}</ns:organisatie>
            <ns:applicatie>${DataSource Values#applicatie_sbB0}</ns:applicatie>
            <ns:referentienummer>${DataSource Values#referentienummer_sbB0}</ns:referentienummer>
         </ns:stuurgegevens>
         <ns:vraag ns:cIDVerzendend="id.vraag0">
            <ns:opties ns:cIDVerzendend="id.opties0">
               <ns:historieMaterieel>${DataSource Values#historieMaterieel_ovb0}</ns:historieMaterieel>
               <ns:historieFormeel>${DataSource Values#historieFormeel_ovb0}</ns:historieFormeel>
               <ns:aanschouwer>${DataSource Values#aanschouwer_ovb0}</ns:aanschouwer>
            </ns:opties>
            <ns:zoekcriteria ns:cIDVerzendend="id.zoekcriteria0">
               <ns:peilmomentMaterieel>${DataSource Values#peilmomentMaterieel_zvb0}</ns:peilmomentMaterieel>
               <ns:peilmomentFormeel>${DataSource Values#peilmomentFormeel_zvb0}</ns:peilmomentFormeel>
               <ns:burgerservicenummer>${DataSource Values#burgerservicenummer_zvb0}</ns:burgerservicenummer>
               <ns:gemeenteCode>${DataSource Values#gemeenteCode_zvb0}</ns:gemeenteCode>
               <ns:naamOpenbareRuimte>${DataSource Values#naamOpenbareRuimte_zvb0}</ns:naamOpenbareRuimte>
               <ns:huisnummer>${DataSource Values#huisnummer_zvb0}</ns:huisnummer>
               <ns:huisletter>${DataSource Values#huisletter_zvb0}</ns:huisletter>
               <ns:huisnummertoevoeging>${DataSource Values#huisnummertoevoeging_zvb0}</ns:huisnummertoevoeging>
               <ns:postcode>${DataSource Values#postcode_zvb0}</ns:postcode>
            </ns:zoekcriteria>
         </ns:vraag>
      </ns:bevragen_VraagPersonenOpAdresInclusiefBetrokkenheden>
   </soapenv:Body>
</soapenv:Envelope>
